#include "std_lib_facilities.h"

int main() {
    cout << "Пожалуйста, введите значение с плавающей точкой: ";
    double n;
    cin >> n;
    cout << "n == " << n
         << "\nn+1 == " << n+1
         << "\nтри раза по n == " << 3*n
         << "\nдва раза по n == " << n+n
         << "\nn в квадрате == " << n*n
         << "\nполовина n == " << n/2
         << "\nкорень квадратный из n == " << sqrt(n)
         << '\n';
    
    cout << "Пожалуйста, введите целочисленное значение: ";
    int in;
    cin >> in;
    cout << "n == " << in
         << "\nn+1 == " << in+1
         << "\nтри раза по n == " << 3*in
         << "\nдва раза по n == " << in+in
         << "\nn в квадрате == " << in*in
         << "\nполовина n == " << in/2
         << "\nкорень квадратный из n == " << sqrt(n = in)
         << '\n';
    return 0;
}
